# PartOfRiserLiesOnBoundaryFailure Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..PartOfRiserLiesOnBoundaryFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Part of the riser lies on the boundary is not allowed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PartOfRiserLiesOnBoundaryFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PartOfRiserLiesOnBoundaryFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PartOfRiserLiesOnBoundaryFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace